In [202]:
import numpy as np

In [203]:
import pandas as pd

In [204]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [205]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [209]:
for i in range(0,df['FlightNumber'].count()):
    if pd.isnull(df.loc[i,'FlightNumber']):
        df.loc[i,'FlightNumber']=df.loc[i-1,'FlightNumber']+10
print(df['FlightNumber'])

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [210]:
df['FlightNumber']=df['FlightNumber'].astype(int)

In [211]:
df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [212]:
sep_col=df['From_To'].str.split("_",expand=True)

In [213]:
df['from_location']=sep_col[0]
df['from_location']

0      LoNDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
Name: from_location, dtype: object

In [214]:
df['to_destination']=sep_col[1]
df['to_destination']

0        paris
1        miLAN
2    StockhOlm
3        PaRis
4       londOn
Name: to_destination, dtype: object

In [215]:
for i in range(0,5):
    df['from_location']=df['from_location'].str.title()
df['from_location']

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: from_location, dtype: object

In [216]:
df.drop(columns=['From_To'],inplace=True)

In [217]:
df

,FlightNumber,RecentDelays,Airline,from_location,to_destination
0,10045,"[23, 47]",KLM(!),London,paris
1,10055,[],<Air France> (12),Madrid,miLAN
2,10065,"[24, 43, 87]",(British Airways. ),London,StockhOlm
3,10075,[13],12. Air France,Budapest,PaRis
4,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [218]:
dfj=pd.DataFrame(df['RecentDelays'].values.tolist(),index=dfj.index).rename(columns=lambda x: 'Delays{}'.format(x+1))
df = df.join(dfj)
df

,FlightNumber,RecentDelays,Airline,from_location,to_destination,Delays1,Delays2,Delays3
0,10045,"[23, 47]",KLM(!),London,paris,23.0,47.0,NaN
1,10055,[],<Air France> (12),Madrid,miLAN,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,StockhOlm,24.0,43.0,87.0
3,10075,[13],12. Air France,Budapest,PaRis,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,londOn,67.0,32.0,NaN

In [219]:
df.drop(columns=['RecentDelays'],inplace=True)
df

,FlightNumber,Airline,from_location,to_destination,Delays1,Delays2,Delays3
0,10045,KLM(!),London,paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,miLAN,NaN,NaN,NaN
2,10065,(British Airways. ),London,StockhOlm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,PaRis,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,londOn,67.0,32.0,NaN